IdeaRS.OpenModel.CrossSection.TendonBar
Tendon bar

IdeaRS.OpenModel.CrossSection.TendonBar.Id
Tendon Id

IdeaRS.OpenModel.CrossSection.TendonBar.TendonType
Tendon type

IdeaRS.OpenModel.CrossSection.TendonBar.Point
Position of bar

IdeaRS.OpenModel.CrossSection.TendonBar.Material
Material

IdeaRS.OpenModel.CrossSection.TendonBar.PrestressingOrder
order of tendon prestessing

IdeaRS.OpenModel.CrossSection.TendonBar.NumStrandsInTendon
number of ropes in tendon

IdeaRS.OpenModel.CrossSection.TendonBar.PrestressReinforcementType
set of prestress reinforcement type

IdeaRS.OpenModel.CrossSection.TendonBar.Phase
Phase

IdeaRS.OpenModel.CrossSection.TendonBar.TendonDuct
Tendon duct